In [ ]:
# Groupby is very common and important operations in Data analysis
# There are mainly 3 steps in Groupby operation

    #Splitting the data into groups based on some criteria.
    #Applying operations to each group independently.
    #Combining the results.

In [2]:
import pandas as pd

In [3]:
# Creating a product DataFrame

d = {
    "Product":["Samsung","Nokia","Samsung","Motorola","Nokia","Samsung","Samsung"],
    "Orders":[2,4,3,4,6,7,3]
    }

In [4]:
df = pd.DataFrame(d)

In [5]:
df

    Product  Orders
0   Samsung       2
1     Nokia       4
2   Samsung       3
3  Motorola       4
4     Nokia       6
5   Samsung       7
6   Samsung       3

In [6]:
grouped = df.groupby(["Product"])
result = grouped.sum()

In [7]:
result

          Orders
Product
Motorola       4
Nokia         10
Samsung       15

In [8]:
df1 = pd.read_csv("sales5.csv")

In [9]:
df1

,Order_Id,Customer_Id,Mail_Id,Product_Name,Product_Cost,Date
0,1,1,nirekshan@gmail.com,Samsung,10000,11/06/2019
1,2,2,kedar@gmail.com,iPhone 8,20000,11/06/2019
2,3,3,Daniel@gmail.com,Kindle Paper White,10000,10/31/2019
3,4,4,prasad@gmail.com,hTC mobile,15000,11/02/2019
4,5,1,nirekshan@gmail.com,Samsung,10000,11/02/2019
5,6,5,partha@gmail.com,iPhone 9,30000,11/06/2019
6,7,4,prasad@gmail.com,hTC mobile,15000,11/10/2019
7,8,6,shahid@gmail.com,iPad,70000,09/01/2019
8,9,4,prasad@gmail.com,LG Washing Machine,25000,09/02/2019
9,10,2,kedar@gmail.com,iPhone 8,20000,09/06/2019
10,11,3,Daniel@gmail.com,Kindle Paper White,10000,09/06/2019
11,12,3,Daniel@gmail.com,Sofa set,50000,09/06/2019
12,13,2,kedar@gmail.com,iPhone 8,20000,11/06/2019
13,14,1,nirekshan@gmail.com,Samsung,10000,11/02/2019
14,15,1,nirekshan@gmail.com,Kindle Paper White,20000,09/06/2019

In [10]:
grouped = df1.groupby(["Mail_Id"])

In [11]:
result=grouped.size()

In [12]:
result

Mail_Id
Daniel@gmail.com       3
kedar@gmail.com        3
nirekshan@gmail.com    4
partha@gmail.com       1
prasad@gmail.com       3
shahid@gmail.com       1
dtype: int64

In [13]:
grouped = df1.groupby(["Product_Name"])

In [14]:
result = grouped.size()

In [15]:
result

Product_Name
Kindle Paper White    3
LG Washing Machine    1
Samsung               3
Sofa set              1
hTC mobile            2
iPad                  1
iPhone 8              3
iPhone 9              1
dtype: int64

In [16]:
# How many products sold out on each month?

In [17]:
df1.columns

Index(['Order_Id', 'Customer_Id', 'Mail_Id', 'Product_Name', 'Product_Cost',
       'Date'],
      dtype='object')

In [18]:
cols=['Date','Product_Name']

In [19]:
grouped = df1.groupby(cols)['Date']
result = grouped.count()

In [20]:
print(result)

Date        Product_Name
09/01/2019  iPad                  1
09/02/2019  LG Washing Machine    1
09/06/2019  Kindle Paper White    2
            Sofa set              1
            iPhone 8              1
10/31/2019  Kindle Paper White    1
11/02/2019  Samsung               2
            hTC mobile            1
11/06/2019  Samsung               1
            iPhone 8              2
            iPhone 9              1
11/10/2019  hTC mobile            1
Name: Date, dtype: int64

In [21]:
# Product wise each month sales

In [22]:
cols = ["Product_Name","Date"]
grouped = df1.groupby(cols)['Date']
result = grouped.count()

In [23]:
result

Product_Name        Date
Kindle Paper White  09/06/2019    2
                    10/31/2019    1
LG Washing Machine  09/02/2019    1
Samsung             11/02/2019    2
                    11/06/2019    1
Sofa set            09/06/2019    1
hTC mobile          11/02/2019    1
                    11/10/2019    1
iPad                09/01/2019    1
iPhone 8            09/06/2019    1
                    11/06/2019    2
iPhone 9            11/06/2019    1
Name: Date, dtype: int64

In [ ]:
# Customer wise each month sales

In [24]:
cols = ["Mail_Id","Date"]
grouped = df1.groupby(cols)["Mail_Id"]

In [25]:
result = grouped.count()

In [26]:
print(result)

Mail_Id              Date
Daniel@gmail.com     09/06/2019    2
                     10/31/2019    1
kedar@gmail.com      09/06/2019    1
                     11/06/2019    2
nirekshan@gmail.com  09/06/2019    1
                     11/02/2019    2
                     11/06/2019    1
partha@gmail.com     11/06/2019    1
prasad@gmail.com     09/02/2019    1
                     11/02/2019    1
                     11/10/2019    1
shahid@gmail.com     09/01/2019    1
Name: Mail_Id, dtype: int64

In [27]:
# Customer wise product details
col = ['Mail_Id',"Product_Name"]
grouped = df1.groupby(col)["Product_Cost"]

In [28]:
result = grouped.sum()

In [29]:
result

Mail_Id              Product_Name
Daniel@gmail.com     Kindle Paper White    20000
                     Sofa set              50000
kedar@gmail.com      iPhone 8              60000
nirekshan@gmail.com  Kindle Paper White    20000
                     Samsung               30000
partha@gmail.com     iPhone 9              30000
prasad@gmail.com     LG Washing Machine    25000
                     hTC mobile            30000
shahid@gmail.com     iPad                  70000
Name: Product_Cost, dtype: int64

In [ ]:
# Customer wise product details

In [31]:
col = ['Mail_Id','Product_Name']
grouped = df1.groupby(col,as_index=False)['Product_Cost']
result = grouped.sum()

In [32]:
result

               Mail_Id        Product_Name  Product_Cost
0     Daniel@gmail.com  Kindle Paper White         20000
1     Daniel@gmail.com            Sofa set         50000
2      kedar@gmail.com            iPhone 8         60000
3  nirekshan@gmail.com  Kindle Paper White         20000
4  nirekshan@gmail.com             Samsung         30000
5     partha@gmail.com            iPhone 9         30000
6     prasad@gmail.com  LG Washing Machine         25000
7     prasad@gmail.com          hTC mobile         30000
8     shahid@gmail.com                iPad         70000

In [ ]:
# Customer wise product details

In [34]:
grouped = df1.groupby(['Mail_Id'])['Product_Cost']

In [35]:
result = grouped.sum()

In [36]:
result

Mail_Id
Daniel@gmail.com       70000
kedar@gmail.com        60000
nirekshan@gmail.com    50000
partha@gmail.com       30000
prasad@gmail.com       55000
shahid@gmail.com       70000
Name: Product_Cost, dtype: int64

In [37]:
# Product wise whole sales

grouped = df1.groupby(['Product_Name'])['Product_Cost']
result = grouped.sum()

In [38]:
result

Product_Name
Kindle Paper White    40000
LG Washing Machine    25000
Samsung               30000
Sofa set              50000
hTC mobile            30000
iPad                  70000
iPhone 8              60000
iPhone 9              30000
Name: Product_Cost, dtype: int64

In [39]:
# Day wise product sales

grouped = df1.groupby(['Date'])['Product_Cost']
result = grouped.sum()

In [40]:
result

Date
09/01/2019     70000
09/02/2019     25000
09/06/2019    100000
10/31/2019     10000
11/02/2019     35000
11/06/2019     80000
11/10/2019     15000
Name: Product_Cost, dtype: int64

In [43]:
# Describe method

df2 = df1['Product_Cost'].describe()

In [44]:
df2

count       15.000000
mean     22333.333333
std      16888.993316
min      10000.000000
25%      10000.000000
50%      20000.000000
75%      22500.000000
max      70000.000000
Name: Product_Cost, dtype: float64

In [47]:
d = {'Product_Cost':sum}

In [48]:
cols = ['Date','Product_Name']

In [49]:
grouped = df1.groupby(cols)

In [50]:
result = grouped.agg(d)

In [51]:
result

                               Product_Cost
Date       Product_Name
09/01/2019 iPad                       70000
09/02/2019 LG Washing Machine         25000
09/06/2019 Kindle Paper White         30000
           Sofa set                   50000
           iPhone 8                   20000
10/31/2019 Kindle Paper White         10000
11/02/2019 Samsung                    20000
           hTC mobile                 15000
11/06/2019 Samsung                    10000
           iPhone 8                   40000
           iPhone 9                   30000
11/10/2019 hTC mobile                 15000

In [52]:
# Applying a single function to columns in groups

d = {
    'Product_Cost':'sum',
    'Product_Name':'count'
}

cols = ["Date","Product_Name"]

grouped = df1.groupby(cols)

In [53]:
result = grouped.agg(d)

In [54]:
result

                               Product_Cost  Product_Name
Date       Product_Name
09/01/2019 iPad                       70000             1
09/02/2019 LG Washing Machine         25000             1
09/06/2019 Kindle Paper White         30000             2
           Sofa set                   50000             1
           iPhone 8                   20000             1
10/31/2019 Kindle Paper White         10000             1
11/02/2019 Samsung                    20000             2
           hTC mobile                 15000             1
11/06/2019 Samsung                    10000             1
           iPhone 8                   40000             2
           iPhone 9                   30000             1
11/10/2019 hTC mobile                 15000             1

In [55]:
d = {
'Product_Cost': [min, max, sum]
}

In [59]:
col = ['Product_Name','Product_Cost']

grouped = df1.groupby(col)
result = grouped.agg(d)

In [60]:
result

                                Product_Cost
                                         min    max    sum
Product_Name       Product_Cost
Kindle Paper White 10000               10000  10000  20000
                   20000               20000  20000  20000
LG Washing Machine 25000               25000  25000  25000
Samsung            10000               10000  10000  30000
Sofa set           50000               50000  50000  50000
hTC mobile         15000               15000  15000  30000
iPad               70000               70000  70000  70000
iPhone 8           20000               20000  20000  60000
iPhone 9           30000               30000  30000  30000